Revit 2024 API
BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthWarning Property
 This is used to post warning. The sum of bar engagements is greater than the total coupler length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EngagementBiggerThanLengthWarning { get; }
Visual Basic
Public Shared ReadOnly Property EngagementBiggerThanLengthWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EngagementBiggerThanLengthWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace